app/controllers/projects_controller.rb

  def index


		@users = User.where(id: current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_project
      @project = Project.find(params[:id])
      @project2 = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]