app/controllers/recordtime_controller.rb

    def index
        @user = User.find(current_user.id)
        @recordstate = Recordstate.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recordstates".* FROM "recordstates"

    def recordedit
      @user = User.find(current_user.id)
      @recordtime = Recordtime.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recordtimes".* FROM "recordtimes" WHERE "recordtimes"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def recordupdate
      @recordtime = Recordtime.find(params[:id])

      rt = Time.zone.local(params[:recordtime]["rt(1i)"].to_i,
                        params[:recordtime]["rt(2i)"].to_i,
                        params[:recordtime]["rt(3i)"].to_i,
                        params[:recordtime]["rt(4i)"].to_i,
                        params[:recordtime]["rt(5i)"].to_i)

      if rt.strftime('%Y-%m-%d') != @recordtime.rt.strftime('%Y-%m-%d')
        redirect_back(fallback_location: root_path, notice: '打刻修正失敗(日付変更はできません)')
        return
      end

      if rt.strftime('%H%M') > '2200'
        @recordtime.night = 1
      else
        @recordtime.night = 0
      end

      begintime =Time.zone.local(rt.strftime('%Y'), rt.strftime('%m'), rt.strftime('%d'), 22, 00)

      puts begintime
      @recordtime.rt = rt
      @recordtime.begin = begintime
      @recordtime.commit = 0

      if @recordtime.save
---
SELECT "recordtimes".* FROM "recordtimes" WHERE "recordtimes"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "recordtimes" SET "rt" = ?, "commit" = ? WHERE "recordtimes"."id" = ?  [["rt", "2019-09-25 03:31:00"], ["commit", 0], ["id", 11]]

    def edit
      @user = User.find(current_user.id)
      @recordstate = Recordstate.all
      @date = Time.zone.parse(params[:date])

      recordtime = Recordtime.where(user_id: current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recordstates".* FROM "recordstates"
SELECT "recordtimes".* FROM "recordtimes" WHERE "recordtimes"."user_id" = ? AND (rt >= '2019-09-24 15:00:00') AND (rt <= '2019-09-25 14:59:59.999999')  [["user_id", 1]]

    def create

      @user = User.find(current_user.id)

      recordtime = Recordtime.where(user_id: current_user.id)
      @date = Time.zone.parse(params[:date])
      recordtime = recordtime.where('rt >= ?', @date.beginning_of_day )
      recordtime = recordtime.where('rt <= ?', @date.end_of_day )
      record1 = recordtime.where(recordstate_id: '1')#出勤
      record2 = recordtime.where(recordstate_id: '2')#退勤
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recordtimes".* FROM "recordtimes" WHERE "recordtimes"."user_id" = ? AND (rt >= '2019-09-24 15:00:00') AND (rt <= '2019-09-25 14:59:59.999999') AND "recordtimes"."recordstate_id" = ?  [["user_id", 1], ["recordstate_id", 1]]


      begintime =Time.zone.local(rt.strftime('%Y'), rt.strftime('%m'), rt.strftime('%d'), 22, 00)

      @recordtime = Recordtime.create(user_id: params[:user_id],
                                      rt: time,
                                      recordstate_id: params[:recordstate_id],
                                      night: night)

      @recordtime.begin = begintime

      if @recordtime.save
---
INSERT INTO "recordtimes" ("user_id", "recordstate_id", "rt") VALUES (?, ?, ?)  [["user_id", 1], ["recordstate_id", 1], ["rt", "2019-09-25 04:31:06"]]
UPDATE "recordtimes" SET "begin" = ? WHERE "recordtimes"."id" = ?  [["begin", "2019-09-25 13:00:00"], ["id", 9]]